In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp311-cp311-macosx_11_0_arm64.whl.metadata (89 kB)
Collecting numpy>=1.23.2 (from pandas)
  Downloading numpy-2.1.2-cp311-cp311-macosx_11_0_arm64.whl.metadata (114 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/envs/cmm/lib/python3.11/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/envs/cmm/lib/python3.11/site-packages (from pandas) (2024.1)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/envs/cmm/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.3-cp311-cp311-macosx_11_0_arm64.whl (11.3 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 11.3/11.3 MB 17.9 MB/s eta 0:00:00a 0:00:01
Downloading numpy-2.1.2-cp311-cp311-macosx_11_0_arm64.whl (13.8 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 13.8/13.8 MB 20.6 MB/s eta 0:00:00a 0:00:01
Downloading tzdata-2024.2-py2.py3-none-any.whl (346 kB)
Installing collected packages: tzdata, numpy, pandas
Successfully installed numpy-2.1.2 pandas-2.2.3 tzdata-2024.2

###Series

###Series

In [3]:
import pandas as pd

index = [1,2,3,4]
data = [20,30,40,50]

pd.Series(data, index=index)

1    20
2    30
3    40
4    50
dtype: int64

In [5]:
!pip install numpy

Requirement already satisfied: numpy in /opt/anaconda3/envs/cmm/lib/python3.11/site-packages (2.1.2)

### Dataframe

In [12]:
import pandas as pd
data = {'Region':['대전','대전','대전','서울','서울','서울'],
        'Year':[2015,2016,2017,2015,2016,2017],
        'Popultaion':[1542,1535,1531,9941,9852,9776]}

df= pd.DataFrame(data)
df

  Region  Year  Popultaion
0     대전  2015        1542
1     대전  2016        1535
2     대전  2017        1531
3     서울  2015        9941
4     서울  2016        9852
5     서울  2017        9776

In [13]:
#columns

list(df.columns)

['Region', 'Year', 'Popultaion']

In [17]:
df[['Region','Year']]

  Region  Year
0     대전  2015
1     대전  2016
2     대전  2017
3     서울  2015
4     서울  2016
5     서울  2017

In [22]:
#loc/ iloc

df.loc[:, 'Year']

0    2015
1    2016
2    2017
3    2015
4    2016
5    2017
Name: Year, dtype: int64

In [23]:
df['Country'] = 'Korea'

df

  Region  Year  Popultaion Country
0     대전  2015        1542   Korea
1     대전  2016        1535   Korea
2     대전  2017        1531   Korea
3     서울  2015        9941   Korea
4     서울  2016        9852   Korea
5     서울  2017        9776   Korea

In [25]:
df['Test']=[0,1,2,3,4,5]

df

  Region  Year  Popultaion Country  Test
0     대전  2015        1542   Korea     0
1     대전  2016        1535   Korea     1
2     대전  2017        1531   Korea     2
3     서울  2015        9941   Korea     3
4     서울  2016        9852   Korea     4
5     서울  2017        9776   Korea     5

In [30]:
##condition

df[(df['Region']=='대전') | (df['Year']==2025)]

  Region  Year  Popultaion Country  Test
0     대전  2015        1542   Korea     0
1     대전  2016        1535   Korea     1
2     대전  2017        1531   Korea     2

In [41]:
#값 지우기

# df.drop(columns='Test')

## 27일까지 과제

### Library Import

In [ ]:
'''
numpy 라이브러리를 np, pandas 라이브러리를 pd로 import 해오기
'''
import numpy as np
import pandas as pd

### 데이터프레임 생성

In [3]:
'''
4x6 (column # - 5, row # - 6) dataframe 생성, 이름 = df_test
column 이름 - A, B, C, D
값 - numpy

Column A - numpy.random 모듈에 있는 random 함수 사용하여 값 분배
Column B - numpy.random 모듈에 있는 randn 함수 사용하여 값 분배
Column C - numpy.random 모듈에 있는 rand 함수 사용하여 값 분배
Column D - numpy.random 모듈에 있는 randint 함수 사용하여 값 분배 (low = 0, high = 10)

- 해당 함수마다 어떤 알고리즘으로 난수를 생성하는지 확인
'''
import numpy as np
import pandas as pd

np.random.seed(42)

df_test = pd.DataFrame({
    'A': np.random.random(6),          
    'B': np.random.randn(6),            
    'C': np.random.rand(6),            
    'D': np.random.randint(0, 10, 6)    })

print(df_test)

          A         B         C  D
0  0.374540  1.579213  0.304242  2
1  0.950714  0.767435  0.524756  6
2  0.731994 -0.469474  0.431945  3
3  0.598658  0.542560  0.291229  8
4  0.156019 -0.463418  0.611853  2
5  0.155995 -0.465730  0.139494  4

### Apply 함수

In [ ]:
'''
Column E - Row 마다 Column A, B, C, D중 최댓값
Column F - Row 마다 Column A, B, C, D중 최솟값
Column G - Row 마다 Column A, B, C, D중 최댓값 - 최솟값
Column H - Row 마다 Column A, B, C, D중 평균값

Key - Column A, B, C, D만 반영해야함
'''

import numpy as np
import pandas as pd

np.random.seed(42)

df_test = pd.DataFrame({
    'A': np.random.random(6),
    'B': np.random.randn(6),
    'C': np.random.rand(6),
    'D': np.random.randint(0, 10, 6)
})

df_test['E'] = df_test[['A', 'B', 'C', 'D']].apply(lambda x: max(x),axis=1)
df_test['F'] = df_test[['A', 'B', 'C', 'D']].min(axis=1)
df_test['G'] = df_test['E'] - df_test['F']
df_test['H'] = df_test[['A', 'B', 'C', 'D']].mean(axis=1)

print(df_test)

          A         B         C  D    E         F         G         H
0  0.374540  1.579213  0.304242  2  2.0  0.304242  1.695758  1.064499
1  0.950714  0.767435  0.524756  6  6.0  0.524756  5.475244  2.060726
2  0.731994 -0.469474  0.431945  3  3.0 -0.469474  3.469474  0.923616
3  0.598658  0.542560  0.291229  8  8.0  0.291229  7.708771  2.358112
4  0.156019 -0.463418  0.611853  2  2.0 -0.463418  2.463418  0.576113
5  0.155995 -0.465730  0.139494  4  4.0 -0.465730  4.465730  0.957440

### Groupby

In [ ]:
'''
1. Column A 앞에 ['A', 'A', 'A', 'B', 'B', 'B'] 리스트를 column이름 Group에 생성 (H 이후에 생성 X)

2. Group값별로 Column C의 Max / Min 구해보기 (출력만 하기)

3. Column I - Group값별로 Column A의 평균값
'''
import numpy as np
import pandas as pd

np.random.seed(42)

df_test = pd.DataFrame({
    'A': np.random.random(6),
    'B': np.random.randn(6),
    'C': np.random.rand(6),
    'D': np.random.randint(0, 10, 6)
})

df_test['E'] = df_test[['A', 'B', 'C', 'D']].max(axis=1)
df_test['F'] = df_test[['A', 'B', 'C', 'D']].min(axis=1)
df_test['G'] = df_test['E'] - df_test['F']
df_test['H'] = df_test[['A', 'B', 'C', 'D']].mean(axis=1)

df_test.insert(0, 'Group', ['A', 'A', 'A', 'B', 'B', 'B'])

grouped_C = df_test.groupby('Group')['C'].agg(['max', 'min'])
print(grouped_C)

df_test['I'] = df_test.groupby('Group')['A'].transform('mean')

print(df_test)

            max       min
Group
A      0.524756  0.304242
B      0.611853  0.139494
  Group         A         B         C  D    E         F         G         H  \
0     A  0.374540  1.579213  0.304242  2  2.0  0.304242  1.695758  1.064499
1     A  0.950714  0.767435  0.524756  6  6.0  0.524756  5.475244  2.060726
2     A  0.731994 -0.469474  0.431945  3  3.0 -0.469474  3.469474  0.923616
3     B  0.598658  0.542560  0.291229  8  8.0  0.291229  7.708771  2.358112
4     B  0.156019 -0.463418  0.611853  2  2.0 -0.463418  2.463418  0.576113
5     B  0.155995 -0.465730  0.139494  4  4.0 -0.465730  4.465730  0.957440

          I
0  0.685749
1  0.685749
2  0.685749
3  0.303557
4  0.303557
5  0.303557